tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/0.orig/alpha.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    walls
    {
        // Cong et al. do not report a static/dynamic acrylic contact angle.
        // Do not fit one to the known GEYSER classification.
        type            zeroGradient;
    }
}
