tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/Allrun.full
#!/usr/bin/env bash
set -euo pipefail

SCRIPT_DIR="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
export BH1_MESH_LEVEL="${BH1_MESH_LEVEL:-base}"
export BH1_VALVE_STATE=open
export BH1_VALVE_DURATION="${BH1_VALVE_DURATION:-0}"
TAU_TAG="${BH1_VALVE_DURATION//./p}"
export BH1_RUN_NAME="${BH1_RUN_NAME:-${BH1_MESH_LEVEL}-open-full-tau${TAU_TAG}}"
export BH1_MODE=full

"$SCRIPT_DIR/Allrun.mesh"
"$SCRIPT_DIR/Allrun.solve"
