tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/Allrun.smoke
#!/usr/bin/env bash
set -euo pipefail

SCRIPT_DIR="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
export BH1_MESH_LEVEL="${BH1_MESH_LEVEL:-base}"
export BH1_VALVE_STATE=open
export BH1_RUN_NAME="${BH1_RUN_NAME:-${BH1_MESH_LEVEL}-open-smoke}"
export BH1_MODE=smoke
export BH1_VALVE_DURATION="${BH1_VALVE_DURATION:-0}"

"$SCRIPT_DIR/Allrun.mesh"
"$SCRIPT_DIR/Allrun.solve"
