tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/Allrun.solve
#!/usr/bin/env bash

SCRIPT_DIR="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
MODEL_DIR="$(cd "$SCRIPT_DIR/.." && pwd)"
CASE_ROOT="$(cd "$MODEL_DIR/../.." && pwd)"
OUTPUT_DIR="$CASE_ROOT/outputs/openfoam3d"

RUN_NAME="${BH1_RUN_NAME:-base-open}"
RUN_DIR="$MODEL_DIR/runs/$RUN_NAME"
MODE="${BH1_MODE:-full}"
MESH_LEVEL="${BH1_MESH_LEVEL:-base}"
VALVE_STATE="${BH1_VALVE_STATE:-open}"
VALVE_DURATION="${BH1_VALVE_DURATION:-0}"
NP="${OPENFOAM_NP:-$(nproc)}"

case "$MODE" in
    static)
        END_TIME="${BH1_END_TIME:-0.50}"
        WRITE_INTERVAL=0.01
        ;;
    smoke)
        END_TIME="${BH1_END_TIME:-0.05}"
        WRITE_INTERVAL=0.01
        ;;
    full)
        END_TIME="${BH1_END_TIME:-13.0}"
        WRITE_INTERVAL=0.10
        ;;
    *)
        echo "BH1_MODE must be static, smoke, or full" >&2
        exit 2
        ;;
esac
if [[ "$MODE" == "static" && "$VALVE_STATE" != "closed" ]]; then
    echo "Static mode requires BH1_VALVE_STATE=closed" >&2
    exit 2
fi
if [[ "$MODE" != "static" && "$VALVE_STATE" != "open" ]]; then
    echo "Event modes require BH1_VALVE_STATE=open" >&2
    exit 2
fi

if [[ ! -f /usr/lib/openfoam/openfoam2512/etc/bashrc ]]; then
    echo "OpenFOAM v2512 is required at /usr/lib/openfoam/openfoam2512" >&2
    exit 3
fi
if [[ ! -d "$RUN_DIR/constant/polyMesh" ]]; then
    echo "Missing mesh in $RUN_DIR; run Allrun.mesh first" >&2
    exit 4
fi
if [[ -d "$RUN_DIR/0" || -d "$RUN_DIR/processor0" ]]; then
    echo "$RUN_DIR already has solution state; rebuild the run directory" >&2
    exit 5
fi
if (( NP > 8 )); then
    NP=8
elif (( NP < 1 )); then
    NP=1
fi

source /usr/lib/openfoam/openfoam2512/etc/bashrc
set -euo pipefail
mkdir -p "$OUTPUT_DIR"
"$MODEL_DIR/solver/Allwmake" > "$RUN_DIR/log.wmake" 2>&1
SOLVER="$FOAM_USER_APPBIN/bh1CompressibleInterFoam"
cd "$RUN_DIR"

cp -a 0.orig 0
python3 "$MODEL_DIR/generate_probes.py" \
    --output system/riserProbeLocations.runtime
setFields > log.setFields 2>&1

if [[ "$MODE" == "static" ]]; then
    createBaffles \
        -dict system/createBafflesDict.closed \
        -overwrite > log.createBaffles.closed 2>&1
    if ! checkMesh -allGeometry -allTopology > log.checkMesh.afterBaffle 2>&1; then
        echo "Extended closed-baffle checkMesh reported documented diagnostics."
    fi
    checkMesh > log.checkMesh.afterBaffle.standard 2>&1
    python3 "$MODEL_DIR/audit_mesh.py" \
        --run-dir "$RUN_DIR" \
        --geometry "$OUTPUT_DIR/mesh-${RUN_NAME}.json" \
        --output "$OUTPUT_DIR/checkMesh-${RUN_NAME}-afterBaffle.json" \
        --mesh-level "$MESH_LEVEL" \
        --valve-state closed \
        --log-name log.checkMesh.afterBaffle \
        --standard-log-name log.checkMesh.afterBaffle.standard
elif [[ "$VALVE_DURATION" != "0" && "$VALVE_DURATION" != "0.0" ]]; then
    python3 "$MODEL_DIR/configure_valve.py" \
        --duration "$VALVE_DURATION" \
        --output constant/valveProperties
fi

foamDictionary system/controlDict -entry endTime -set "$END_TIME" >/dev/null
foamDictionary system/controlDict -entry writeInterval -set "$WRITE_INTERVAL" >/dev/null

cp system/decomposeParDict system/decomposeParDict.runtime
foamDictionary system/decomposeParDict.runtime \
    -entry numberOfSubdomains -set "$NP" >/dev/null
decomposePar -decomposeParDict system/decomposeParDict.runtime \
    > log.decomposePar 2>&1

OMPI_ALLOW_RUN_AS_ROOT=1 \
OMPI_ALLOW_RUN_AS_ROOT_CONFIRM=1 \
mpirun -np "$NP" "$SOLVER" -parallel \
    > log.bh1CompressibleInterFoam 2>&1

python3 "$MODEL_DIR/postprocess_openfoam.py" \
    --run-dir "$RUN_DIR" \
    --mode "$MODE" \
    --valve-duration "$VALVE_DURATION" \
    --output-dir "$OUTPUT_DIR" \
    --experimental-levels "$CASE_ROOT/data/digitized/fig9a_levels.csv" \
    --experimental-pressure "$CASE_ROOT/data/digitized/fig10a_pt1.csv" \
    --one-d "$CASE_ROOT/outputs/caseA_model_series.csv"

echo "BH1_${MODE^^}_DONE=$RUN_DIR"
