tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/Allrun.static
#!/usr/bin/env bash
set -euo pipefail

SCRIPT_DIR="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
export BH1_MESH_LEVEL="${BH1_MESH_LEVEL:-base}"
export BH1_VALVE_STATE=closed
export BH1_RUN_NAME="${BH1_RUN_NAME:-${BH1_MESH_LEVEL}-closed-static}"
export BH1_MODE=static
export BH1_VALVE_DURATION=0

"$SCRIPT_DIR/Allrun.mesh"
"$SCRIPT_DIR/Allrun.solve"
