tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Neither paper reports turbulence inlet data or a calibrated closure.
simulationType  laminar;
