tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.05 -0.05 -0.15)
    ( 6.65 -0.05 -0.15)
    ( 6.65  3.05 -0.15)
    (-0.05  3.05 -0.15)
    (-0.05 -0.05  0.15)
    ( 6.65 -0.05  0.15)
    ( 6.65  3.05  0.15)
    (-0.05  3.05  0.15)
);

// Approximately 50 mm background cells.  The z planes coincide with the
// exterior-atmosphere sidewalls, avoiding thin clipped corner cells.
// snappy volume regions refine the main, the 16 mm riser, and the plume.
blocks
(
    hex (0 1 2 3 4 5 6 7) (134 62 6) simpleGrading (1 1 1)
);

edges ();

boundary
(
    backgroundBoundary
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
