tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name inlet;
        patchInfo { type patch; }
        constructFrom patches;
        patches (inlet);
    }
    {
        name atmosphere;
        patchInfo { type patch; }
        constructFrom patches;
        // z=+/-0.15 background faces coincide with the open exterior sides.
        patches (atmosphere backgroundBoundary);
    }
    {
        name walls;
        patchInfo { type wall; }
        constructFrom patches;
        patches (walls riserWall);
    }
);
