tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 4;
method              scotch;

constraints
{
    baffles
    {
        type        preserveBaffles;
        enabled     true;
    }
    faceZones
    {
        type        preserveFaceZones;
        zones       (".*");
        enabled     true;
    }
}
