tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;
    // Bounded startup scheme from the v2512 compressibleInterFoam
    // depthCharge3D water-air reference case.
    div(rhoPhi,U)       Gauss upwind;
    div(rhoPhi,T)       Gauss upwind;
    div(rhoPhi,K)       Gauss upwind;
    div(phi,p)          Gauss upwind;
    div(phi,k)          Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear uncorrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             uncorrected;
}

fluxRequired
{
    default             no;
    p_rgh;
    pcorr;
    alpha.water;
}
