tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr          1;
        nAlphaSubCycles     2;
        cAlpha              1;
        MULESCorr           no;
        nLimiterIter        5;
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-8;
        relTol              0;
    }

    ".*(rho|rhoFinal)"
    {
        solver              diagonal;
    }

    "pcorr.*"
    {
        solver              PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0;
            smoother        DICGaussSeidel;
        }
        tolerance           1e-5;
        relTol              0;
        maxIter             100;
    }

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0.01;
        smoother            DIC;
    }

    p_rghFinal
    {
        solver              PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-7;
            relTol          0;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
        }
        tolerance           1e-7;
        relTol              0;
        maxIter             100;
    }

    "U.*"
    {
        solver              smoothSolver;
        smoother            GaussSeidel;
        tolerance           1e-6;
        relTol              0;
        nSweeps             1;
    }

    "T.*"
    {
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-8;
        relTol              0;
        maxIter             100;
    }
}

PIMPLE
{
    // v2512 depthCharge3D water-air reference settings.
    momentumPredictor          no;
    transonic                  no;
    nOuterCorrectors           1;
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;
}
