tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

walls.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    subsetFeatures { nonManifoldEdges no; openEdges yes; }
}
riserWall.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    subsetFeatures { nonManifoldEdges no; openEdges yes; }
}
inlet.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    subsetFeatures { nonManifoldEdges no; openEdges yes; }
}
atmosphere.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    subsetFeatures { nonManifoldEdges no; openEdges yes; }
}
