tests/test_02_cong2017/cases/BH1_Dr16_H066_L061/openfoam/3d/case/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name            tunnelZone;
        type            cellZoneSet;
        action          new;
        source          cylinderToCell;
        point1          (0 0 0);
        point2          (6.6 0 0);
        radius          0.0251;
    }
    {
        name            initialPocketZone;
        type            cellZoneSet;
        action          new;
        source          cylinderToCell;
        point1          (5.989 0 0);
        point2          (6.601 0 0);
        radius          0.0251;
    }
    {
        name            physicalRiserZone;
        type            cellZoneSet;
        action          new;
        source          cylinderToCell;
        point1          (3.47 0 0);
        point2          (3.47 1.825 0);
        radius          0.0081;
    }
    {
        name            exteriorZone;
        type            cellZoneSet;
        action          new;
        source          boxToCell;
        box             (3.319 1.825 -0.151) (3.621 3.026 0.151);
    }
    {
        // Four base-mesh or eight refined-mesh axial layers immediately
        // upstream of the selected valve. The solver verifies that the zone
        // volume represents the declared 25 mm resistance length.
        name            valveResistanceZone;
        type            cellZoneSet;
        action          new;
        source          boxToCell;
        box             (5.96 -0.026 -0.026) (5.985 0.026 0.026);
    }
    {
        name            valvePlane;
        type            faceZoneSet;
        action          new;
        source          planeToFaceZone;
        point           (5.99 0 0);
        normal          (1 0 0);
        option          closest;
    }
    {
        name            riserMouth;
        type            faceZoneSet;
        action          new;
        source          planeToFaceZone;
        point           (3.47 1.82 0);
        normal          (0 1 0);
        option          closest;
    }
);
